<!-- dflook/terraform-github-actions {"workspace":"gh-actions-user","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"27b791c55411175545b507f5174e90773f276b2adf0e8b850e467088b61e6cb8","plan_job_ref":"Job Test plan target and replace #353 at https://github.com/dflook/terraform-github-actions/actions/runs/5609975691","plan_hash":"25ececd51e81ec2f7214ed303be206c1be56b407057901c15afda179cd0ae961","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __gh-actions-user__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "enasq4w4Fo" -> (known after apply)
  ~ foreach = "ixHYgVpsEt" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #353](https://github.com/dflook/terraform-github-actions/actions/runs/5609975691)